KrishnaPraveenR/DBBR-FDAP2/DBBR-Multinode-FDAP2/sources/CC2520/CC2520_Macros.h
//=========================================================================================
// Name:        CC2520_macros.h
// Author:      Gourav Sharma
// Date:        December 2009
// Description: CC2520 Driver
// Changes:     
// Revisions:   
//=========================================================================================

#ifndef CC2520_MACROS_H
#define CC2520_MACROS_H

#include "../global.h"
#include "../spi1.h"
#include "../spi0.h"
#include "cc2520.h"

#ifdef BBR2_HW // Include this file only if hardware is BBR2 HW

//  SPIx Macros
//      cmd = command strobe
//      ra = register address
//      rv = register value


//=========================================================================================================
// Read, Write byte(s), word(s), comands
//=========================================================================================================
#define CC2520_SECCTRL0_NO_SECURITY      0x0000
#define CC2520_SECCTRL0_CBC_MAC          0x0001
#define CC2520_SECCTRL0_CTR              0x0002
#define CC2520_SECCTRL0_CCM              0x0003

#define CC2520_SECCTRL0_SEC_M_4_BYTES    BIN16(00000000,00000100)

#define CC2520_SECCTRL0_SEC_SAKEYSEL     BIT7
#define CC2520_SECCTRL0_SEC_CBC_HEAD     BIT8


// ==================================================================================================================
// ============================= Radio 1 Related Macro Definitions ==================================================
// ==================================================================================================================
//-------------------------------------------------
// Macro: CC2520_1_MACRO_STROBE
//-------------------------------------------------
// attention !!, next macros are not {} protected so be carefull when use it
#define CC2520_1_MACRO_STROBE(cmd)      CC2520_1_MACRO_RESELECT();\
                                        SPI1_WriteByte(cmd);\
                                        SPI1_WaitEndTx()
                                                        

//#define CC2520_MACRO_STROBE_GET_STATUS(cmd, statusByte) SPI1_WRITEB_READB(cmd, statusByte)

//-------------------------------------------------
// Macro: CC2520_1_MACRO_SETREG/CC2520_1_MACRO_GETREG
// Note: These Macros can only be used for addressses 
// less than 0x40 only
//-------------------------------------------------
#define CC2520_1_MACRO_SETREG(regAddr,regValue)   CC2520_1_MACRO_RESELECT();\
                                                  SPI1_WriteByte(CC2520_REGWR | regAddr); \
                                                  SPI1_WriteByte( (unsigned char)( regValue ) ); \
                                                  SPI1_WaitEndTx()

#define CC2520_1_MACRO_GETREG(regAddr,regValue)   CC2520_1_MACRO_RESELECT();\
                                                  SPI1_WriteByte(CC2520_REGRD | regAddr); \
                                                  SPI1_ReadByte( regValue );

//-------------------------------------------------
// Macro: CC2520_1_MACRO_SETMEM/CC2520_1_MACRO_GETMEM
// Note: These call are meant to be used only for 
// addresses in the range 0x000 to ox0XX. It cannot 
// be used for whole Radio memory.
//-------------------------------------------------
#define CC2520_1_MACRO_SETMEM(memAddr,value)      CC2520_1_MACRO_RESELECT();\
                                                  SPI1_WriteByte(CC2520_MEMWR); \
                                                  SPI1_WriteByte(memAddr); \
                                                  SPI1_WriteByte( (unsigned char)( value ) ); \
                                                  SPI1_WaitEndTx()


#define CC2520_1_MACRO_GETMEM(memAddr,regValue)   CC2520_1_MACRO_RESELECT();\
                                                  SPI1_WriteByte(CC2520_MEMRD); \
                                                  SPI1_WriteByte(memAddr); \
                                                  SPI1_ReadByte( regValue );

//=========================================================================================================
// Specific comands/configuration
//=========================================================================================================
#define CC2520_1_MACRO_SET_RFCH_0TO15(ch)  CC2520_1_MACRO_SETREG(CC2520_FREQCTRL, ((unsigned char)(ch * 5 + 11) & 0x7F))
#define CC2520_1_MACRO_GET_RFCH_0TO15(ch)  CC2520_1_MACRO_GETREG(CC2520_FREQCTRL, ch);  
//-------------------------------------------------
// Macro: CC2520_1_MACRO_GET_STATUS
//-------------------------------------------------
#define CC2520_1_MACRO_GET_STATUS(rv) SPI1_ReadByte(rv)

#define CC2520_1_MACRO_GET_PA(pa) CC2520_1_MACRO_GETMEM(CC2520_TXPOWER, pa)
#define CC2520_1_MACRO_SET_PA(pa) CC2520_1_MACRO_SETMEM(CC2520_TXPOWER, (unsigned char)(pa & 0xFF))

//-------------------------------------------------
// Macro: CC2520 Macros to FLUSH the RXFIFO and the TXFIFO
//-------------------------------------------------
#define CC2520_1_MACRO_FLUSH_RXFIFO() CC2520_1_MACRO_STROBE(CC2520_SFLUSHRX); CC2520_1_MACRO_STROBE(CC2520_SFLUSHRX)
#define CC2520_1_MACRO_FLUSH_TXFIFO() CC2520_1_MACRO_STROBE(CC2520_SFLUSHTX); CC2520_1_MACRO_STROBE(CC2520_SFLUSHTX);

//-------------------------------------------------
// Macro: CC2520 Macros to get the length of receive FIFO
//-------------------------------------------------
#define CC2520_1_MACRO_READ_RXFIFO_LEN(b)   CC2520_1_MACRO_GETREG(CC2520_RXFIRST, b)

//-------------------------------------------------
// Macro: CC2520 Macros to Read and Write RAM data Little/Big Endian
// Note: Address should be a valid address to call this MACRO
//-------------------------------------------------
#define CC2520_1_MACRO_READ_RAM_LITTLE_E(ptr,addr,cnt) {SPI1_WriteByte((unsigned char)(CC2520_MEMRD | ((0x0F00 & addr)>>8))); \
                                                        SPI1_WriteByte((unsigned char)(addr & 0x00FF)); \
                                                        SPI1_ReadBuff(ptr, cnt); \
                                                        }

