KrishnaPraveenR/DBBR-FDAP2/DBBR-Multinode-FDAP2/sources/CC2520/CC2520_Macros.h
#define CC2520_1_MACRO_DECRYPT_ACKFIFO()   {  unsigned char plainTxt; \
         CC2520_1_MACRO_GET_AES_RX_PLAINTEXT(plainTxt); \
         CC2520_1_MACRO_CRYPT(CC2520_UCCM_HIGH_P, (uint8)(CC2520_RAM_KEY0>>4), 0, (uint8)(CC2520_RX_NONCE>>4), CC2520_RX_DECRYP_BUFF, 0,plainTxt,1); \
                                          }

#define CC2520_1_MACRO_ENCRYPT_TXFIFO(encLen,MicSize)   {  unsigned char plainTxt;\
                                           CC2520_1_MACRO_GET_AES_TX_PLAINTEXT(plainTxt);\
                                           CC2520_1_MACRO_CRYPT(CC2520_CCM_HIGH_P, \
                                                             (uint8)(CC2520_RAM_KEY0>>4),\
                                                              encLen, (uint8)(CC2520_TX_NONCE>>4), \
                                                              CC2520_RAM_TXBUF + 1, 0, \
                                                              plainTxt, \
                                                              MicSize);\
                                         }

#define CC2520_1_MACRO_ENCRYPT_SA_BUFFER() { SPI1_WriteByte(CC2520_ECBO_HIGH_P);\
                                             SPI1_WriteByte((uint8)(CC2520_RAM_KEY1>>4));\
                                             SPI1_WriteByte((uint8)((CC2520_SA_BUFF & 0x0F00)>>8));\
                                             SPI1_WriteByte((uint8)(CC2520_SA_BUFF & 0x00FF));\
                                             SPI1_WaitEndTx(); \
                                           }

//-------------------------------------------------------------
// Macro: CC2520 Macro to set and get current Encryption mode
//-------------------------------------------------------------
#define CC2520_1_MACRO_SET_AES_MODE(aesMode)    { g_unCC2520SecCtrl_0 = (g_unCC2520SecCtrl_0 & 0xFFFC) | aesMode; }
#define CC2520_1_MACRO_GET_AES_MODE(rv)         { rv = g_unCC2520SecCtrl_0 & 0x0003;} 
// ------------------------------------------------------------------------------------------------------------------

// ==================================================================================================================
// ============================= Radio 2 Related Macro Definitions ==================================================
// ==================================================================================================================
//-------------------------------------------------
// Macro: CC2520_2_MACRO_STROBE
//-------------------------------------------------
// attention !!, next macros are not {} protected so be carefull when use it
#define CC2520_2_MACRO_STROBE(cmd)      CC2520_2_MACRO_RESELECT();\
                                        SPI0_Radio2_WriteByte(cmd);\
                                        SPI0_WaitEndTx()
                                                        
//-------------------------------------------------
// Macro: CC2520_2_MACRO_SETREG/CC2520_2_MACRO_GETREG
// Note: These Macros can only be used for addressses 
// less than 0x40 only
//-------------------------------------------------
#define CC2520_2_MACRO_SETREG(regAddr,regValue)   CC2520_2_MACRO_RESELECT();\
                                                  SPI0_Radio2_WriteByte(CC2520_REGWR | regAddr); \
                                                  SPI0_Radio2_WriteByte( (unsigned char)( regValue ) ); \
                                                  SPI0_WaitEndTx()

#define CC2520_2_MACRO_GETREG(regAddr,regValue)   CC2520_2_MACRO_RESELECT();\
                                                  SPI0_Radio2_WriteByte(CC2520_REGRD | regAddr); \
                                                  SPI0_Radio2_ReadByte( regValue );

//-------------------------------------------------
// Macro: CC2520_2_MACRO_SETMEM/CC2520_2_MACRO_GETMEM
// Note: These call are meant to be used only for 
// addresses in the range 0x000 to ox0XX. It cannot 
// be used for whole Radio memory.
//-------------------------------------------------
#define CC2520_2_MACRO_SETMEM(memAddr,value)      CC2520_2_MACRO_RESELECT();\
                                                  SPI0_Radio2_WriteByte(CC2520_MEMWR); \
                                                  SPI0_Radio2_WriteByte(memAddr); \
                                                  SPI0_Radio2_WriteByte( (unsigned char)( value ) ); \
                                                  SPI0_WaitEndTx()


#define CC2520_2_MACRO_GETMEM(memAddr,regValue)   CC2520_2_MACRO_RESELECT();\
                                                  SPI0_Radio2_WriteByte(CC2520_MEMRD); \
                                                  SPI0_Radio2_WriteByte(memAddr); \
                                                  SPI0_Radio2_ReadByte( regValue );

//=========================================================================================================
// Specific comands/configuration
//=========================================================================================================
#define CC2520_2_MACRO_SET_RFCH_0TO15(ch)  CC2520_2_MACRO_SETREG(CC2520_FREQCTRL, ((unsigned char)(ch * 5 + 11) & 0x7F))
#define CC2520_2_MACRO_GET_RFCH_0TO15(ch)  CC2520_2_MACRO_GETREG(CC2520_FREQCTRL, ch);  
//-------------------------------------------------
// Macro: CC2520_2_MACRO_GET_STATUS
//-------------------------------------------------
#define CC2520_2_MACRO_GET_STATUS(rv) SPI0_Radio2_ReadByte(rv)

#define CC2520_2_MACRO_GET_PA(pa) CC2520_2_MACRO_GETMEM(CC2520_TXPOWER, pa)
#define CC2520_2_MACRO_SET_PA(pa) CC2520_2_MACRO_SETMEM(CC2520_TXPOWER, (unsigned char)(pa & 0xFF))

//-------------------------------------------------
// Macro: CC2520 Macros to FLUSH the RXFIFO and the TXFIFO
//-------------------------------------------------
#define CC2520_2_MACRO_FLUSH_RXFIFO() CC2520_2_MACRO_STROBE(CC2520_SFLUSHRX); CC2520_2_MACRO_STROBE(CC2520_SFLUSHRX)
#define CC2520_2_MACRO_FLUSH_TXFIFO() CC2520_2_MACRO_STROBE(CC2520_SFLUSHTX); CC2520_2_MACRO_STROBE(CC2520_SFLUSHTX);

//-------------------------------------------------
// Macro: CC2520 Macros to get the length of receive FIFO
//-------------------------------------------------
#define CC2520_2_MACRO_READ_RXFIFO_LEN(b)   CC2520_2_MACRO_GETREG(CC2520_RXFIRST, b)

//-------------------------------------------------
// Macro: CC2520 Macros to Read and Write RAM data Little/Big Endian
// Note: Address should be a valid address to call this MACRO
//-------------------------------------------------
#define CC2520_2_MACRO_READ_RAM_LITTLE_E(ptr,addr,cnt) {SPI0_Radio2_WriteByte((unsigned char)(CC2520_MEMRD | ((0x0F00 & addr)>>8))); \
                                                        SPI0_Radio2_WriteByte((unsigned char)(addr & 0x00FF)); \
                                                        SPI0_Radio2_ReadBuff(ptr, cnt); \
                                                        }

