KrishnaPraveenR/DBBR-FDAP2/DBBR-Multinode-FDAP2/sources/CC2520/CC2520_Macros.h
#define CC2520_2_MACRO_READ_RAM_BIG_E(ptr,addr,cnt)    {SPI0_Radio2_WriteByte((unsigned char)(CC2520_MEMRD | ((0x0F00 & addr)>>8))); \
                                                        SPI0_Radio2_WriteByte((unsigned char)(addr & 0x00FF)); \
                                                        SPI0_Radio2_ReadBuffReverse(ptr,cnt); }


#define CC2520_2_MACRO_WRITE_RAM_LITTLE_E(ptr,addr,cnt) {SPI0_Radio2_WriteByte((unsigned char)(CC2520_MEMWR | ((0x0F00 & addr)>>8))); \
                                                         SPI0_Radio2_WriteByte((unsigned char)(addr & 0x00FF)); \
                                                         SPI0_Radio2_WriteBuff(ptr, cnt); }

#define CC2520_2_MACRO_WRITE_RAM_BIG_E(ptr,addr,cnt)   {SPI0_Radio2_WriteByte((unsigned char)(CC2520_MEMWR | ((0x0F00 & addr)>>8))); \
                                                        SPI0_Radio2_WriteByte((unsigned char)(addr & 0x00FF)); \
                                                        SPI0_Radio2_WriteBuffReverse(ptr, cnt); }

//--------------------------------------------------------
// Macro: CC2520 Macro to write data in to the Tx Buffer
//--------------------------------------------------------
#define CC2520_2_LOAD_TX_BUFFER(msgptr, len)   { CC2520_2_MACRO_RESELECT();\
                                                 SPI0_Radio2_WriteByte((unsigned char)(CC2520_TXBUF));\
                                                 SPI0_Radio2_WriteByte((unsigned char)(len + 2));  \
                                                 SPI0_Radio2_WriteBuff(msgptr, len);\
                                               }

#define CC2520_2_LOAD_RX_BUFFER(msgptr, len)   { CC2520_2_MACRO_RESELECT();\
                                                 SPI0_Radio2_WriteByte((unsigned char)(CC2520_MEMWR | ((0x0F00 & CC2520_RX_DECRYP_BUFF)>>8))); \
                                                 SPI0_Radio2_WriteByte((unsigned char)(CC2520_RX_DECRYP_BUFF & 0x00FF)); \
                                                 SPI0_Radio2_WriteBuff(msgptr, len); \
                                               }

//-------------------------------------------------
// Macro: CC2520 Macro to:
//   Read/Write from/to the Stand-Alone Encryption Buffer (SABUF 16 bytes)
//-------------------------------------------------
#define CC2520_2_MACRO_GET_SABUF(p)  CC2520_2_MACRO_READ_RAM_LITTLE_E( p, CC2520_SA_BUFF, 16)
#define CC2520_2_MACRO_SET_SABUF(p)  CC2520_2_MACRO_WRITE_RAM_LITTLE_E(p, CC2520_SA_BUFF, 16)

//------------------------------------------------------------------------
// Macro: CC2520 Macro to Write Encryption KEY0 and  KEY1
//   CC2520RAM_KEY0 address is user defined and is 128-bit long
//------------------------------------------------------------------------

#define CC2520_2_MACRO_SET_ENCKEY0(p)    CC2520_2_MACRO_WRITE_RAM_BIG_E(p, CC2520_RAM_KEY0, 16)
#define CC2520_2_MACRO_SET_ENCKEY1(p)    CC2520_2_MACRO_WRITE_RAM_BIG_E(p, CC2520_RAM_KEY1, 16)


#define CC2520_2_MACRO_WRITE_NONCE(addr,b0,nonce,b14,b15) {\
                    SPI0_Radio2_WriteByte((unsigned char)(CC2520_MEMWR | ((0x0F00 & addr)>>8))); \
                    SPI0_Radio2_WriteByte((unsigned char)(addr & 0x00FF)); \
                    SPI0_Radio2_WriteByte((unsigned char)b15); \
                    SPI0_Radio2_WriteByte((unsigned char)b14); \
                    SPI0_Radio2_WriteBuffReverse(nonce,13); \
                    SPI0_Radio2_WriteByte((unsigned char)b0); \
                    SPI0_WaitEndTx(); \
                    }

//-------------------------------------------------
// Macro: CC2520 Macros to set/get the RX/TX nonce
//-------------------------------------------------
#define CC2520_2_MACRO_SET_RX_NONCE(b0,nonce,b14,b15)  CC2520_2_MACRO_WRITE_NONCE(CC2520_RX_NONCE,b0,nonce,b14,b15)
#define CC2520_2_MACRO_SET_TX_NONCE(b0,nonce,b14,b15)  CC2520_2_MACRO_WRITE_NONCE(CC2520_TX_NONCE,b0,nonce,b14,b15)

#define CC2520_2_MACRO_GET_RX_NONCE(p) CC2520_2_MACRO_READ_RAM_BIG_E(p, CC2520_RX_NONCE, 16)
#define CC2520_2_MACRO_GET_TX_NONCE(p) CC2520_2_MACRO_READ_RAM_BIG_E(p, CC2520_TX_NONCE, 16)

//-------------------------------------------------
// Macro: CC2520 Macros to store/read the AES RX/TX Plaintext number of bytes
//-------------------------------------------------
#define CC2520_2_MACRO_SET_AES_RX_PLAINTEXT(aesPlainLen) { g_unCC2520SecCtrl_1 = (g_unCC2520SecCtrl_1 & 0xFF00) | (aesPlainLen); }
#define CC2520_2_MACRO_SET_AES_TX_PLAINTEXT(aesPlainLen) { g_unCC2520SecCtrl_1 = (g_unCC2520SecCtrl_1 & 0xFF) | ((unsigned int)(aesPlainLen) << 8);}
#define CC2520_2_MACRO_GET_AES_RX_PLAINTEXT(rv)          { rv = g_unCC2520SecCtrl_1 & 0x00FF;}
#define CC2520_2_MACRO_GET_AES_TX_PLAINTEXT(rv)          { rv = g_unCC2520SecCtrl_1 >> 8;}

//--------------------------------------------------------------------------
// Macro: CC2520 Macros to Encrypt and Decrypt various buffers 
// i.e. Rx, Tx and StandAlone buffer
// Arguments:
// cmd     -> Encryption Command with Priority Bit
// key     -> Address of the key
// c       -> No. of byets to be used for encryption
// nonce   -> Address where the Nonce is located
// inaddr  -> Start Address of the data to be Encrypted + Authenticated
// outaddr -> Address where to store the Encrypted + Authenticated data
// f       -> Number of bytes to be Authenticated
// m       -> Number of MIC Bytes to be generated
//--------------------------------------------------------------------------
#define CC2520_2_MACRO_CRYPT(cmd, key, c, nonce, inaddr, outaddr, f, m)     { SPI0_Radio2_WriteByte(cmd);      \
                                                                              SPI0_Radio2_WriteByte(key);      \
                                                                              SPI0_Radio2_WriteByte(c&0x7F); \
                                                                              SPI0_Radio2_WriteByte(nonce);    \
                                                                              SPI0_Radio2_WriteByte((uint8)((((inaddr) & 0x0F00)>>4) | (((outaddr) & 0x0F00)>>8)));\
                                                                              SPI0_Radio2_WriteByte((uint8)((inaddr) & 0x00FF));   \
                                                                              SPI0_Radio2_WriteByte((uint8)((outaddr) & 0x00FF));  \
                                                                              SPI0_Radio2_WriteByte(f & 0x7F); \
                                                                              SPI0_Radio2_WriteByte(m & 0x03); \
                                                                              SPI0_WaitEndTx(); }

#define CC2520_2_MACRO_DECRYPT_RXFIFO(EncLen, MicSize)   {  unsigned char plainTxt; \
         CC2520_2_MACRO_GET_AES_RX_PLAINTEXT(plainTxt); \
         CC2520_2_MACRO_CRYPT(CC2520_UCCM_HIGH_P, (uint8)(CC2520_RAM_KEY0>>4), EncLen, (uint8)(CC2520_RX_NONCE>>4), CC2520_RAM_RXBUF+1, 0,plainTxt, MicSize); \
                                          }        

#define CC2520_2_MACRO_DECRYPT_ACKFIFO()   {  unsigned char plainTxt; \
         CC2520_2_MACRO_GET_AES_RX_PLAINTEXT(plainTxt); \
         CC2520_2_MACRO_CRYPT(CC2520_UCCM_HIGH_P, (uint8)(CC2520_RAM_KEY0>>4), 0, (uint8)(CC2520_RX_NONCE>>4), CC2520_RX_DECRYP_BUFF, 0,plainTxt,1); \
                                          }        

#define CC2520_2_MACRO_ENCRYPT_TXFIFO(encLen,MicSize)   {  unsigned char plainTxt;\
                                           CC2520_2_MACRO_GET_AES_TX_PLAINTEXT(plainTxt);\
                                           CC2520_2_MACRO_CRYPT(CC2520_CCM_HIGH_P, \
                                                             (uint8)(CC2520_RAM_KEY0>>4),\
                                                              encLen, (uint8)(CC2520_TX_NONCE>>4), \
                                                              CC2520_RAM_TXBUF + 1, 0, \
                                                              plainTxt, \
                                                              MicSize);\
                                         }

#define CC2520_2_MACRO_ENCRYPT_SA_BUFFER() { SPI0_Radio2_WriteByte(CC2520_ECBO_HIGH_P);\
                                             SPI0_Radio2_WriteByte((uint8)(CC2520_RAM_KEY1>>4));\
                                             SPI0_Radio2_WriteByte((uint8)((CC2520_SA_BUFF & 0x0F00)>>8));\
                                             SPI0_Radio2_WriteByte((uint8)(CC2520_SA_BUFF & 0x00FF));\
                                             SPI0_WaitEndTx(); \
                                           }

//-------------------------------------------------------------
// Macro: CC2520 Macro to set and get current Encryption mode
//-------------------------------------------------------------
#define CC2520_2_MACRO_SET_AES_MODE(aesMode)    { g_unCC2520SecCtrl_0 = (g_unCC2520SecCtrl_0 & 0xFFFC) | aesMode; }
#define CC2520_2_MACRO_GET_AES_MODE(rv)         { rv = g_unCC2520SecCtrl_0 & 0x0003;} 
//------------------------------------------------------------------------------------------------------------------------

#endif // BBR2_HW

#endif
